Repository: CentreForDigitalHumanities/gen-ai-reflection
Catalog: frontend/locale/messages.*.xlf
Languages: nl

source: toggle navigation
nl: toon/verberg navigatie

source: Centre for Digital Humanities, Utrecht University
nl: Centre for Digital Humanities, Universiteit Utrecht

source: Source code
nl: Broncode

source: Switch to light mode
nl: Schakel lichte modus in

source: GenAI Reflection
nl: GenAI Reflectietool

source: (BSD 3-Clause License)
nl: (BSD 3-clausule licentie)

source: Version:
nl: Versie:

source: Switch to dark mode
nl: Schakel donkere modus in

# ngb.alert.close
source: Close
nl: Sluiten

# ngb.carousel.next
source: Next
nl: Volgende

# ngb.carousel.previous
source: Previous
nl: Vorige

# ngb.carousel.slide-number
source: Slide {INTERPOLATION} of {INTERPOLATION_1}
nl: Slide {INTERPOLATION} van {INTERPOLATION_1}

# ngb.datepicker.next-month
source: Next month
nl: Volgende maand

# ngb.datepicker.previous-month
source: Previous month
nl: Vorige maand

# ngb.datepicker.select-month
source: Select month
nl: Selecteer maand

# ngb.datepicker.select-year
source: Select year
nl: Selecteer jaar

# ngb.pagination.first-aria
source: First
nl: Eerste

# ngb.pagination.last-aria
source: Last
nl: Laatste

# ngb.pagination.next-aria
source: Next
nl: Volgende

# ngb.pagination.previous-aria
source: Previous
nl: Vorige

# ngb.timepicker.decrement-hours
source: Decrement hours
nl: Minder uren

# ngb.timepicker.decrement-minutes
source: Decrement minutes
nl: Minder minuten

# ngb.timepicker.decrement-seconds
source: Decrement seconds
nl: Minder seconden

# ngb.timepicker.HH
source: HH
nl: UU

# ngb.timepicker.hours
source: Hours
nl: Uren

# ngb.timepicker.increment-hours
source: Increment hours
nl: Meer uren

# ngb.timepicker.increment-minutes
source: Increment minutes
nl: Meer minuten

# ngb.timepicker.increment-seconds
source: Increment seconds
nl: Meer seconden

# ngb.timepicker.minutes
source: Minutes
nl: Minuten

# ngb.timepicker.seconds
source: Seconds
nl: Seconden

# ngb.toast.close-aria
source: Close
nl: Sluiten

source: Assessment form:
nl: Beoordelingsvorm:

source: Select an assessment form
nl: Selecteer een beoordelingsvorm

source: No assessment forms available
nl: Geen beoordelingsvormen beschikbaar

source: Remove assessment form
nl: Verwijder beoordelingsvorm

source: Which ILOs are tested with this assessment? Select one or multiple.
nl: Welke leerdoelen (ILO's) worden met deze beoordelingsvorm getoetst? Kies er een of meerdere.

source: Does the potential use of GenAI in the assessment, as listed above, affect the extent to which {form.controls.iloIds.value.length, plural, =1 {this learning goal} other {these learning goals}} can be tested?
nl: Beïnvloedt het mogelijke gebruik van generatieve AI in de beoordeling de mate waarin {form.controls.iloIds.value.length, plural, =1 {dit leerdoel} other {deze leerdoelen}} getest kunnen worden?

source: {VAR_PLURAL, plural, =1 {this learning goal} other {these learning goals}}
nl: {VAR_PLURAL, plural, =1 {dit leerdoel} other {deze leerdoelen}}

source: Yes
nl: Ja

source: No
nl: Nee

source: Suggested adjustments
nl: Voorgestelde aanpassingen

source: No adjustments available. Select an assessment form first.
nl: Geen aanpassingen beschikbaar. Kies eerst een beoordelingsvorm uit de lijst.

source: Known AI Uses for this assessment form
nl: Bekende gebruikswijzen generatieve AI voor deze beoordelingsvorm

source: Click the bars below to see examples of ways in which students may use GenAI for this assessment form.
nl: Klik op de balken hieronder om manieren te zien waarop studenten generatieve AI voor deze beoordelingsvorm kunnen gebruiken.

source: In this step, you will receive information on how students can make use of GenAI for the assessments in your course.
nl: In deze stap vind je meer informatie over hoe studenten generatieve AI kunnen gebruiken voor de beoordelingen in je cursus.

source: After adding an assessment, you decide whether the use of GenAI is a problem in this context, based on the ILOs that are tested. If you consider the use of GenAI in the assessment a problem, the tool suggests alternatives.
nl: Na het toevoegen van een beoordeling kun je aangeven of het gebruik van generatieve AI, gelet op de leerdoelen die hiermee getest worden, in deze context problematisch is. Als je het gebruik van generatieve AI problematisch voor de beoordeling problematisch acht, biedt de tool een aantal alternatieven.

source: Next, pick one or more intended learning outcomes that are assessed in this way and whose assessment could be affected by the use of GenAI.
nl: Kies vervolgens een of meerdere leerdoelen die op deze manier beoordeeld worden en waarvan de beoordeling door het gebruik van GenAI beïnvloed zou kunnen worden.

source: Go to Step 3
nl: Verder naar Stap 3

source: Back to Step 1
nl: Terug naar Stap 1

source: No ILOs available. Add some in the previous step.
nl: Geen leerdoelen beschikbaar. Voeg er een of meerdere toe in de vorige stap.

source: No AI
nl: Geen AI

source: AI planning
nl: Voorbereiden met AI

source: AI collaboration
nl: Samenwerken met AI

source: Full AI
nl: Volledig

source: AI exploration
nl: Verkennen met AI

source: Click on one of the five levels to find examples of educational exercises or assignments that make use of generative AI to different degrees (levels 2-5) or not at all (level 1). You can check off examples that you are interested in. These will be included in your final report.
nl: Klik op een van de vijf niveaus hieronder om voorbeelden te zien van educatieve oefeningen of opdrachten die in wisselende mate (niveaus 2-5) of helemaal geen (niveau 1) gebruik maken van generatieve AI. Vink voorbeelden aan die je interesseren. Deze komen in het uiteindelijke rapport terecht.

source: Select the options below that you would like to include in your summary report.
nl: Selecteer de opties die je graag in het eindrapport terug zou willen zien.

source: No examples found.
nl: Geen voorbeelden gevonden.

source: Back to Step 2
nl: Terug naar Stap 2

source: Generative AI - A four-step reflection tool
nl: Generatieve AI - Een reflectietool in vier stappen

source: Select your department to begin
nl: Selecteer je departement om te beginnen

source: What is this tool for?
nl: Waar is deze tool voor?

source: This tool consists of four subsequent steps:
nl: Deze tool bestaat uit vier opeenvolgende stappen:

source: <strong class="step-title"> 🌍 Step 1: Learning outcomes analysis </strong> clarify and map your course goals.
nl: <strong class="step-title"> 🌍 Stap 1: Leerdoelanalyse </strong> zet de doelen van je cursus uiteen.

source: <strong class="step-title"> 🚀 Step 2: Assessments </strong> assess whether the use of generative AI in assignments negatively impacts the learning outcomes.
nl: <strong class="step-title"> 🚀 Stap 2: Beoordelingen </strong> toetst of het gebruik van generatieve AI in opdrachten een negatieve invloed heeft op het behalen van de leerdoelen.

source: <strong class="step-title"> 🌙 Step 3: Rethinking courses in times of GenAI </strong> explore how generative AI can be used to enhance your course.
nl: <strong class="step-title"> 🌙 Stap 3: Cursussen heroverwegen in tijden van GenAI </strong> onderzoekt hoe generatieve AI eventueel gebruikt zou kunnen worden om je cursus te verbeteren.

source: Before we begin...
nl: Voor we beginnen...

source: Course name
nl: Cursusnaam

source: Go to Step 1
nl: Naar Stap 1

source: 🌍 Step 1: Learning Outcomes
nl: 🌍 Stap 1: Leerdoelen

source: In this step, you will map the Intended Learning Outcomes (ILOs) for your course and link each one to the most relevant Dublin Descriptor.
nl: In deze stap koppel je de beoogde leerdoelen ('Intended Learning Outcomes', ofwel ILO's) voor je cursus aan de meest relevante Dublin-descriptor.

source: The Dublin Descriptors are internationally recognized criteria to classify learning outcomes, and used on a program-level in our department. They are organized into five categories:
nl: De Dublin-descriptoren zijn internationaal erkende criteria voor leerdoelen. Ze worden op programmaniveau binnen ons departement gebruikt en bestaan uit vijf categorieën:

source: Knowledge and understanding
nl: Kennis en inzicht

source: Applying knowledge and understanding
nl: Toepassen kennis en inzicht

source: Making judgments
nl: Oordeelsvorming

source: Communication
nl: Communicatie

source: Lifelong learning skills
nl: Leervaardigheden

source: Intended Outcome
nl: Beoogd leerdoel

source: Actions
nl: Acties

source: Remove
nl: Verwijder

source: AI Challenges:
nl: AI-uitdagingen:

source: AI Opportunities:
nl: AI-kansen:

source: Add new intended learning outcome
nl: Voeg nieuw beoogd leerdoel toe

source: Go to Step 2
nl: Naar Stap 2

source: Back to Introduction
nl: Terug naar Introductie

source: Select an option
nl: Selecteer een optie

source: Knowledge and Understanding
nl: Kennis en Inzicht

source: Applying Knowledge and Understanding
nl: Toepassen Kennis en Inzicht

source: Making Judgements
nl: Oordeelsvorming

source: Lifelong Learning Skills
nl: Leervaardigheden

source: Remove assessment form
nl: Verwijder beoordelingsvorm

source: Enter the name of your course...
nl: Voer de naam van je cursus in...

source: Additional information regarding the university policy on generative AI can be found here. (Links will open in a new tab.)
nl: Meer informatie over het universiteitsbeleid ten opzichte van generatieve AI vind je hier. (Links openen in een nieuw tabblad.)

source: UU AI policy (general page):
nl: UU AI-beleid (algemene pagina):

source: AI index (for teachers):
nl: AI-index (voor docenten):

source: https://www.uu.nl/en/organisation/ai-policy
nl: https://www.uu.nl/organisatie/ai-beleid

source: https://www.uu.nl/en/organisation/ai-policy/teachers/for-teachers/ai-index
nl: https://www.uu.nl/organisatie/ai-beleid/docenten/voor-docenten/ai-index

source: AI Assessment Scale (click to enlarge)
nl: AI Assessment Scale (klik om te vergroten)

source: Close
nl: Sluiten

source: (Link will open in a new tab.)
nl: (Link opent in een nieuw tabblad.)

source: In other words, evaluate whether you think {form.controls.iloIds.value.length, plural, =1 {the ILO} other {the ILOs}} can still be tested with the chosen type of assignment, assuming that students will use GenAI in the ways listed above and, potentially, more. If you select ‘No’, your assessment is GenAI resilient. Congratulations! If you select ‘Yes’, you will be presented some suggestions to make your assessment more resilient.
nl: In andere woorden: denk na over de vraag of {form.controls.iloIds.value.length, plural, =1 {het leerdoel} other {de leerdoelen}} nog steeds behaald kunnen worden met deze beoordeling, in de vooronderstelling dat studenten GenAI op de hierboven beschreven (en wellicht nog andere) manieren zullen gebruiken. Als je 'Nee' antwoordt, dan is je beoordeling AI-bestendig. Gefeliciteerd! Als je 'Ja' kiest, toont deze tool suggesties om je beoordeling bestendiger te maken.

source: {VAR_PLURAL, plural, =1 {the ILO} other {the ILOs}}
nl: {VAR_PLURAL, plural, =1 {het leerdoel} other {de leerdoelen}}

source: 🚀 Step 2: Assessments
nl: 🚀 Step 2: Beoordelingen

source: Please select one type of assessment. You can add more below.
nl: Selecteer een beoordelingsvorm. Je kunt er hieronder meerdere toevoegen.

source: Add assessment
nl: Voeg beoordeling toe

source: 🌙 Step 3: Rethinking courses in times of GenAI
nl: 🌙 Stap 3: Cursussen heroverwegen in tijden van GenAI

source: The previous steps aimed at checking the extent to which your current course design is resilient against the potential use of GenAI. In this third step, you are invited to reconsider exercises or assignments by involving generative AI to various extents. The AI assessment scale that this step is based on, has officially been accepted by the UU as a guiding principle. It helps teachers to think of generative AI in a less binary manner – not as something that is either forbidden or approved, but as a set of tools that can be integrated in academic education to different degrees.
nl: In de vorige stappen probeerden we vast te stellen in hoeverre het huidige cursusontwerp bestand is tegen het mogelijke gebruik van generatieve AI. In deze derde stap word je gestimuleerd om opgaven en beoordelingen te heroverwegen door generatieve AI in meer of mindere mate hierin te integreren. De AI-beoordelingsschaal die aan deze stap ten grondslag ligt, is officieel door de UU als leidraad gekozen. Zij helpt docenten om minder zwart-wit over generatieve AI na te denken – niet als iets wat geheel verboden of toegestaan is, maar als een set gereedschappen die in wisselende mate in academisch onderwijs geïntegreerd kunnen worden.

source: Go to Step 4
nl: Verder naar Stap 4

source: Welcome to the <strong>GenAI reflection tool</strong>. This tool is designed to reflect on the impact of GenAI on the learning goals of individual courses. It works best if you run this tool with a particular course in mind (and to have the course manual ready). The tool will guide you through some steps (see below) that challenge you to reflect on the validity of the intended learning outcomes of the course and the effectiveness of the assignments to test these. Once finished, you will be offered a report with an overview of the outcomes.
nl: Welkom in deze <strong> GenAI-reflectietool</strong> . Deze tool is ontworpen om je te laten reflecteren op de impact van GenAI op de leerdoelen van individuele cursussen. Het is het beste als je deze tool met een specifieke cursus in gedachte doorloopt (en de cursushandleiding bij de hand houdt). De tool zal je door een aantal stappen leiden (zie hieronder) die je uitdagen om te reflecteren op de validiteit van de beoogde leerdoelen van de cursus en de effectiviteit van de beoordelingen die gebruikt worden om deze te testen. Na afronding biedt deze tool je een rapport met een overzicht van de bevindingen.

source: You can run the tool as many times and for as many courses as you like. We do not store or save the information you enter in this tool.
nl: Je kunt de tool zo vaak en voor zo veel cursussen doorlopen als je wilt. We slaan de informatie die je in deze tool invoert nergens op.

source: How the tool works
nl: Hoe de tool in zijn werk gaat

source: <strong class="step-title"> ✨ Step 4: Report </strong> after finishing the tool you can download a report with the most important outcomes.
nl: <strong class="step-title"> ✨ Stap 4: Rapportage </strong> na het doorlopen van de tool kun je een gepersonaliseerd rapport downloaden met de belangrijkste bevindingen.

source: Enter the intended learning outcomes of your course here (one per field). You can do this in your own words. For each ILO you enter, please select the Dublin Descriptor that best aligns.
nl: Voer hier de beoogde leerdoelen (ILO's) van je cursus in (één per veld). Je kunt dit in je eigen woorden doen. Kies voor iedere ingevoerde ILO de Dublin-descriptor die er het beste bijpast.

source: Below you will find a scale with five levels of AI integration in educational assessments, based on the <a href="https://aiassessmentscale.com/" target="_blank" > AI Assessment Scale (AIAS)</a > developed by Perkins et al. (2024).
nl: Hieronder vind je een schaal met vijf niveaus waarin generatieve AI in educatieve opdrachten geïntegreerd kan worden, gebaseerd op de <a href="https://aiassessmentscale.com/" target="_blank" > AI Assessment Scale (AIAS)</a > van Perkins et al. (2024).

source: Generate report
nl: Rapport aanmaken

source: Download report
nl: Rapport downloaden

source: Back to Step 3
nl: Terug naar stap 3

source: Start over
nl: Opnieuw beginnen

source: Please provide the name of your course. This will personalize the final report.
nl: Vul de naam van de cursus in. Hiermee wordt het rapport gepersonaliseerd.

source: You have completed the <strong>GenAI reflection tool</strong>! To generate the report, please enter your name and click the button below.
nl: Dit is het einde van de <strong>Reflectietool GenAI</strong>! Vul je naam in en klik op de knop hieronder om het rapport aan te maken.

source: Your name:
nl: Naam:

source: Enter your name...
nl: Vul je naam in...

source: This application has been developed by <a href="mailto:p.huijnen@uu.nl">Pim Huijnen</a > and <a href="mailto:s.falcke@uu.nl">Swantje Falcke</a > in collaboration with the <a href="https://cdh.uu.nl/">Centre for Digital Humanities</a > within the context of the USO project <a href="https://teaching-and-learning-collection.sites.uu.nl/project/ai-in-higher-education/" >"AI in Higher Education: Building reflective awareness through educational interventions"</a >.
nl: Deze applicatie is ontwikkeld door <a href="mailto:p.huijnen@uu.nl">Pim Huijnen</a > en <a href="mailto:s.falcke@uu.nl">Swantje Falcke</a > in samenwerking met het <a href="https://cdh.uu.nl/">Centre for Digital Humanities</a > in het kader van het USO-project <a href="https://teaching-and-learning-collection.sites.uu.nl/project/ai-in-higher-education/" >"AI in Higher Education: Building reflective awareness through educational interventions"</a >.

source: You are free to share and adapt the contents of this site, if you give appropriate credit and use it non-commercially. More on <a href="https://creativecommons.org/licenses/by-nc/4.0/" target="_blank" rel="noopener">Creative Commons</a>.
nl: Je kunt de inhoud van deze website vrij hergebruiken, mits je bronvermelding geeft en het gaat om niet-commercieel gebruik. Meer informatie op <a href="https://creativecommons.org/licenses/by-nc/4.0/" target="_blank" rel="noopener">Creative Commons</a>.

source: ✨ Step 4: Report
nl: ✨ Stap 4: Rapportage

source: No known AI uses available for this assessment form.
nl: Er zijn geen bekende gebruikswijzen voor generatieve AI voor deze beoordelingsvorm.

source: Your data will not be saved if you close this page. You can download a report as part of the last step. If you do not want to save your data, you can safely close this page.
nl: Je gegevens worden niet opgeslagen als je deze pagina afsluit. Tijdens de laatste stap kun je een rapport downloaden. Als je je gegevens niet wilt bewaren, kun je de pagina zonder problemen sluiten.
