Repository: CentreForDigitalHumanities/gen-ai-reflection
Catalog: backend/report/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Report
nl: Rapport

source: Course name:
nl: Naam cursus:

source: Department:
nl: Departement:

source: Filled in by:
nl: Ingevuld door:

source: Date of generation:
nl: Aanmaakdatum:

source: This report summarizes your reflection about the role of GenAI in the above mentioned course. The aim of this report is to stimulate reflection on the impact of generative AI on academic teaching. Students can use generative AI for almost all assignments. The question whether assessment forms need to be adapted as a consequence of this, depends on the intended learning outcomes that the assignments test. This is why this report aims to make an explicit link between assessment forms and learning outcomes. Wherever the use of generative AI is considered problematic, the tool provides alternative assessment forms, or stimulates you to consider changing the learning outcomes.
nl: Dit rapport is een samenvatting van de rol van generatieve AI bij de bovengenoemde cursus. Met dit rapport wordt reflectie op de impact van generatieve AI op academisch onderwijs gestimuleerd. Studenten kunnen generatieve AI voor bijna alle opdrachten gebruiken. Het antwoord op de vraag of daarom toetsvormen aangepast moeten worden hangt af van de beoogde leerdoelen van de toetsvorm. In dit rapport wordt daarom een expliciete koppeling gemaakt tussen toetsvormen en leerdoelen. Als het gebruik van generatieve AI als problematisch wordt beschouwd stelt de tool alternatieve toetsvormen voor, of moedigt de tool aan om een aanpassing aan de leerdoelen te overwegen.

source: Step 1: Learning Outcomes
nl: Stap 1: Leerdoelen

source: AI Challenges
nl: AI-kansen

source: AI Opportunities
nl: AI-uitdagingen

source: Step 2: Assessment Forms
nl: Stap 2: Beoordelingen

source: Known AI Uses
nl: Bekende AI-gebruikswijzen

source: Connected learning outcomes
nl: Verbonden leerdoelen

source: Impact of AI on assessment
nl: Impact van AI op beoordeling

source: The use of AI <strong>does</strong> affect the extent to which this learning goal can be tested by this assignment. Suggested adjustments:
nl: Het gebruik van AI <strong>heeft invloed</strong> op de mate waarin dit leerdoel getoetst kan worden door deze toetsvorm. Voorgestelde aanpassingen:

source: The use of AI <strong>does not</strong> affect the extent to which this learning goal can be tested by this assignment.
nl: Het gebruik van AI heeft <strong>geen</strong> invloed op de mate waarin dit leerdoel getoetst kan worden door deze toetsvorm.

source: Step 3: Rethinking Courses
nl: Stap 3: Cursussen heroverwegen

source: If you need further information about GenAI in education at Utrecht University, check out <a href="https://intranet.uu.nl/en/generative-ai-in-education" target="_blank" >Generative AI in Education - Intranet</a >.
nl: Kijk voor meer informatie over generatieve AI in het onderwijs aan de Universiteit Utrecht op <a href="https://intranet.uu.nl/generatieve-ai-in-het-onderwijs" target="_blank">Generatieve AI in het Onderwijs - Intranet</a>.
